In [4]:
import pandas as pd 
import numpy as np

In [9]:
people = { 
    'first':['Corey','Jane','John','Chris',np.nan,None,'NA'],
    'last' :['Schafer','Doe','Doe','Schafer',np.nan,np.nan,'Missing'],
    'email':['CoreyMSchafer@gmail.com','JaneDoe@gmail.com','JohnDoe@gmail.com','ChrisSchafer@gmail.com',None,np.nan,'NA'],
     'age'  :['33','55','63','36',None,None,'Missing']
}

In [14]:
df = pd.DataFrame(people)


df.replace('NA',np.nan,inplace=True)
df.replace('Missing',np.nan,inplace=True)

In [15]:
df

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com    33
1   Jane      Doe        JaneDoe@gmail.com    55
2   John      Doe        JohnDoe@gmail.com    63
3  Chris  Schafer   ChrisSchafer@gmail.com    36
4    NaN      NaN                     None  None
5   None      NaN                      NaN  None
6    NaN      NaN                      NaN   NaN

In [16]:
df.dropna()

   first     last                    email age
0  Corey  Schafer  CoreyMSchafer@gmail.com  33
1   Jane      Doe        JaneDoe@gmail.com  55
2   John      Doe        JohnDoe@gmail.com  63
3  Chris  Schafer   ChrisSchafer@gmail.com  36

In [17]:
df.dropna(axis='index',how='any')

   first     last                    email age
0  Corey  Schafer  CoreyMSchafer@gmail.com  33
1   Jane      Doe        JaneDoe@gmail.com  55
2   John      Doe        JohnDoe@gmail.com  63
3  Chris  Schafer   ChrisSchafer@gmail.com  36

In [18]:
df.isna()

   first   last  email    age
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False  False  False
4   True   True   True   True
5   True   True   True   True
6   True   True   True   True

In [19]:
df.fillna('MISSING')

     first     last                    email      age
0    Corey  Schafer  CoreyMSchafer@gmail.com       33
1     Jane      Doe        JaneDoe@gmail.com       55
2     John      Doe        JohnDoe@gmail.com       63
3    Chris  Schafer   ChrisSchafer@gmail.com       36
4  MISSING  MISSING                  MISSING  MISSING
5  MISSING  MISSING                  MISSING  MISSING
6  MISSING  MISSING                  MISSING  MISSING

In [20]:
df

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com    33
1   Jane      Doe        JaneDoe@gmail.com    55
2   John      Doe        JohnDoe@gmail.com    63
3  Chris  Schafer   ChrisSchafer@gmail.com    36
4    NaN      NaN                     None  None
5   None      NaN                      NaN  None
6    NaN      NaN                      NaN   NaN

In [22]:
df.dtypes

first    object
last     object
email    object
age      object
dtype: object

In [23]:
df['age'] = df['age'].astype(float)

In [24]:
df

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com  33.0
1   Jane      Doe        JaneDoe@gmail.com  55.0
2   John      Doe        JohnDoe@gmail.com  63.0
3  Chris  Schafer   ChrisSchafer@gmail.com  36.0
4    NaN      NaN                     None   NaN
5   None      NaN                      NaN   NaN
6    NaN      NaN                      NaN   NaN

In [25]:
type(np.nan)

float

In [26]:
df.dtypes

first     object
last      object
email     object
age      float64
dtype: object

In [27]:
df['age'].mean()

46.75